simulator/elbowFlow2d/0/org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    largeInlet
    {
        type            fixedValue;
        value           uniform (0 -LARGE_INLET_VELOCITY 0);
    }

    smallInlet
    {
        type            fixedValue;
        value           uniform (0 SMALL_INLET_VELOCITY 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    wall2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
