simulator/elbowFlow2d/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wall1
    {
        type            wall;
        nFaces          100;
        startFace       1300;
    }
    outlet
    {
        type            patch;
        nFaces          8;
        startFace       1400;
    }
    smallInlet
    {
        type            patch;
        nFaces          4;
        startFace       1408;
    }
    largeInlet
    {
        type            patch;
        nFaces          8;
        startFace       1412;
    }
    wall2
    {
        type            wall;
        nFaces          34;
        startFace       1420;
    }
    frontAndBackPlanes
    {
        type            empty;
        nFaces          1836;
        startFace       1454;
    }
)


// ************************************************************************* //
