simulator/elbowFlow2d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.05;

writeControl    timeStep;

writeInterval   200; // only write the last time-step

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

functions
{
    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type        probes;

        // Name of the directory for probe data
        name        probes;
        probeLocations
        (
            //( 0.056 0.063 0 )      // centre of large inlet
            // ( 0.001 0.008 0 )     // centre of outlet
            ( 0.04 0.008 0 )        // centre of pipe after mixing point
        );

        // Fields to be probed
        fields ( U );

        // Write at same frequency as fields
        outputControl   outputTime;
        outputInterval  1;
    }
}

// ************************************************************************* //
